In [1]:
import pandas

In [35]:
df1 = pandas.DataFrame()

In [36]:
df1['K']=[1, 2, 3, 4]

In [37]:
df1['A']=['A1', 'A2', 'A3', 'A4']

In [38]:
df1

   K   A
0  1  A1
1  2  A2
2  3  A3
3  4  A4

In [39]:
df2 = pandas.DataFrame([[1,'B1'], [2, 'B2'], [2, 'B22'], [3, 'B3']], columns=['K', 'B'])

In [40]:
df2

   K    B
0  1   B1
1  2   B2
2  2  B22
3  3   B3

In [44]:
df1.set_index('K').join(df2.set_index('K'), how='outer')

    A    B
K
1  A1   B1
2  A2   B2
2  A2  B22
3  A3   B3
4  A4  NaN

   K   A
0  1  A1
1  2  A2
2  3  A3

In [51]:
dfx = pandas.DataFrame(columns=['Isin', 'Morning', 'Date'])
dfx['Isin'] = ['b1','b2','b3','b4']
dfx['Morning'] = ['Hello'] * 4
dfx['Date'] = ['25/3'] * 4

In [52]:
dfx

  Isin Morning  Date
0   b1   Hello  25/3
1   b2   Hello  25/3
2   b3   Hello  25/3
3   b4   Hello  25/3

In [55]:
dfy = pandas.DataFrame(columns=['Isin', 'Evening', 'Issue', 'Fund'])
dfy['Isin'] = ['b1','b2','b1','b3','b4']
dfy['Evening'] = ['Bye'] * 5
dfy['Issue'] = ['25/3'] * 5
dfy['Fund'] = [11, 22, 33, 44, 55]

In [56]:
dfy

  Isin Evening Issue  Fund
0   b1     Bye  25/3    11
1   b2     Bye  25/3    22
2   b1     Bye  25/3    33
3   b3     Bye  25/3    44
4   b4     Bye  25/3    55

In [58]:
dfx.set_index('Isin').join(dfy.set_index('Isin'), how='outer')

     Morning  Date Evening Issue  Fund
Isin
b1     Hello  25/3     Bye  25/3    11
b1     Hello  25/3     Bye  25/3    33
b2     Hello  25/3     Bye  25/3    22
b3     Hello  25/3     Bye  25/3    44
b4     Hello  25/3     Bye  25/3    55